try:
    import ujson as json
except ImportError:
    import json
import os
from pathlib import Path


configkey = [
    "LEVLECOST",
    "等级建设度",
    "发放宗门资材",
    "每日宗门任务次上限",
    "宗门任务完成cd",
    "宗门任务刷新cd",
    "宗门任务",
    "宗门主功法参数",
    "宗门神通参数",
    "宗门丹房参数"
]
CONFIG = {
    "LEVLECOST": {
        # 攻击/元血/灵海修炼的灵石消耗
        # 0-29级
        '0': 500000, '1': 500000, '2': 500000, '3': 500000, '4': 500000, '5': 500000, 
        '6': 500000, '7': 500000, '8': 500000, '9': 500000,
        '10': 1000000, '11': 1000000, '12': 1000000, '13': 1000000, '14': 1000000,
        '15': 1000000, '16': 1000000, '17': 1000000, '18': 1000000, '19': 1000000,
        '20': 2000000, '21': 2000000, '22': 2000000, '23': 2000000, '24': 2000000,
        '25': 2000000, '26': 2000000, '27': 2000000, '28': 2000000, '29': 2000000,
        
        # 30-89级
        '30': 8000000, '31': 8000000, '32': 8000000, '33': 8000000, '34': 8000000,
        '35': 8000000, '36': 8000000, '37': 8000000, '38': 8000000, '39': 8000000,
        '40': 16000000, '41': 16000000, '42': 16000000, '43': 16000000, '44': 16000000,
        '45': 16000000, '46': 16000000, '47': 16000000, '48': 16000000, '49': 16000000,
        '50': 32000000, '51': 32000000, '52': 32000000, '53': 32000000, '54': 32000000,
        '55': 32000000, '56': 32000000, '57': 32000000, '58': 32000000, '59': 32000000,
        '60': 64000000, '61': 64000000, '62': 64000000, '63': 64000000, '64': 64000000,
        '65': 64000000, '66': 64000000, '67': 64000000, '68': 64000000, '69': 64000000,
        '70': 128000000, '71': 128000000, '72': 128000000, '73': 128000000, '74': 128000000,
        '75': 128000000, '76': 128000000, '77': 128000000, '78': 128000000, '79': 128000000,
        '80': 256000000, '81': 256000000, '82': 256000000, '83': 256000000, '84': 256000000,
        '85': 256000000, '86': 256000000, '87': 256000000, '88': 256000000, '89': 256000000,
        
        # 90-100级
        '90': 585000000, '91': 585000000, '92': 585000000, '93': 585000000, '94': 585000000,
        '95': 585000000, '96': 585000000, '97': 585000000, '98': 585000000, '99': 585000000, 
        '100': 585000000
    },
    "等级建设度": 5000000,  # 决定宗门修炼上限等级的参数，500万贡献度每级
    "发放宗门资材": {
        "时间": "11-12",  # 定时任务发放宗门资材，每日11-12点根据 对应宗门贡献度的 * 倍率 发放资材
        "倍率": 1,  # 倍率
    },
    "每日宗门任务次上限": 3,
    "宗门任务完成cd": 60,  # 宗门任务每次完成间隔，单位秒
    "宗门任务刷新cd": 10,  # 宗门任务刷新间隔，单位秒
    "宗门主功法参数": {
        "获取消耗的资材": 60000000,  # 最终消耗会乘档位
        "获取消耗的灵石": 3000000,  # 最终消耗会乘档位
        "获取到功法的概率": 10,
        "建设度": 10000000,  # 建设度除以此参数，一共10档（10档目前无法配置,对应天地玄黄人上下）
        "学习资材消耗": 6000000,  # 最终消耗会乘档位
    },
    "宗门神通参数": {
        "获取消耗的资材": 60000000,  # 最终消耗会乘档位
        "获取消耗的灵石": 3000000,  # 最终消耗会乘档位
        "获取到神通的概率": 10,
        "建设度": 10000000,  # 建设度除以此参数，一共10档（10档目前无法配置,对应天地玄黄人上下）
        "学习资材消耗": 6000000,  # 最终消耗会乘档位
    },
    "宗门丹房参数": {
        "领取贡献度要求": 10000000,
        "elixir_room_level": {
            "1": {
                "name": "黄级",
                "level_up_cost": {
                    "建设度": 50000000,  # 升级消耗建设度
                    "stone": 200000  # 升级消耗宗门灵石
                },
                "give_level": {
                    "give_num": 5,  # 每日领取的丹药数量
                    "rank_up": 1  # rank增幅等级，影响丹药获取品质，目前高于6会无法获得丹药
                }
            },
            "2": {
                "name": "玄级",
                "level_up_cost": {
                    "建设度": 60000000,
                    "stone": 400000
                },
                "give_level": {
                    "give_num": 6,
                    "rank_up": 1
                }
            },
            "3": {
                "name": "地级",
                "level_up_cost": {
                    "建设度": 70000000,
                    "stone": 800000
                },
                "give_level": {
                    "give_num": 7,
                    "rank_up": 1
                }
            },
            "4": {
                "name": "天级",
                "level_up_cost": {
                    "建设度": 80000000,
                    "stone": 1600000
                },
                "give_level": {
                    "give_num": 8,
                    "rank_up": 2
                }
            },
            "5": {
                "name": "仙级",
                "level_up_cost": {
                    "建设度": 100000000,
                    "stone": 3200000
                },
                "give_level": {
                    "give_num": 9,
                    "rank_up": 2
                }
            },
            "6": {
                "name": "仙王级",
                "level_up_cost": {
                    "建设度": 1000000000,
                    "stone": 100000000
                },
                "give_level": {
                    "give_num": 11,
                    "rank_up": 3
                }
            },
            "7": {
                "name": "仙帝级",
                "level_up_cost": {
                    "建设度": 2000000000,
                    "stone": 150000000
                },
                "give_level": {
                    "give_num": 13,
                    "rank_up": 4
                }
            },
            "8": {
                "name": "无上",
                "level_up_cost": {
                    "建设度": 5000000000,
                    "stone": 300000000
                },
                "give_level": {
                    "give_num": 15,
                    "rank_up": 5
                }
            }
        }
    },
    "宗门任务": {
        # type=1：需要扣气血，type=2：需要扣灵石
        # cost：消耗，type=1时，气血百分比，type=2时，消耗灵石
        # give：给与玩家当前修为的百分比修为
        # sect：给与所在宗门 储备的灵石，同时会增加灵石 * 10 的建设度
        "狩猎邪修": {
            "desc": "传言山外村庄有邪修抢夺灵石，请道友下山为民除害",
            "type": 1,
            "cost": 0.45,
            "give": 0.012,
            "sect": 1400000
        },
        "查抄窝点": {
            "desc": "有少量弟子不在金银阁消费，私自架设小型窝点，请道友前去查抄",
            "type": 1,
            "cost": 0.35,
            "give": 0.01,
            "sect": 1000000
        },
        "九转仙丹": {
            "desc": "山门将开，宗门急缺一批药草熬制九转丹，请道友下山购买",
            "type": 2,
            "cost": 900000,
            "give": 0.008,
            "sect": 1500000
        },
        "仗义疏财": {
            "desc": "在宗门外见到师弟欠了别人灵石被追打催债，请道友帮助其还清赌债",
            "type": 2,
            "cost": 1000000,
            "give": 0.0085,
            "sect": 1200000
        },
        "红尘寻宝": {
            "desc": "山下一月一度的市场又开张了，其中虽凡物较多，但是请道友慷慨解囊，为宗门购买一些蒙尘奇宝",
            "type": 2,
            "cost": 1500000,
            "give": 0.009,
            "sect": 1800000
        },
        "镇守仙阵": {
            "desc": "宗门仙阵出现不稳迹象，请道友协助镇守，确保阵法正常运行",
            "type": 1,
            "cost": 0.40,
            "give": 0.011,
            "sect": 1000000
        },
        "斩妖除魔": {
            "desc": "近期妖魔活动频繁，请道友前往镇压，保护百姓安宁",
            "type": 1,
            "cost": 0.50,
            "give": 0.014,
            "sect": 1600000
        },
        "寻访名师": {
            "desc": "宗门仙阵出现不稳迹象，请道友协助镇守，确保阵法正常运行",
            "type": 2,
            "cost": 500000,
            "give": 0.007,
            "sect": 1100000
        },
        "采集灵草": {
            "desc": "宗门药园灵草短缺，请道友外出采集，以供炼丹之用",
            "type": 1,
            "cost": 0.30,
            "give": 0.0095,
            "sect": 900000
        }
    }
}


def get_config():
    try:
        config = readf()
        for key in configkey:
            if key not in list(config.keys()):
                config[key] = CONFIG[key]
        savef(config)
    except:
        config = CONFIG
        savef(config)
    return config


CONFIGJSONPATH = Path(__file__).parent
FILEPATH = CONFIGJSONPATH / 'config.json'


def readf():
    with open(FILEPATH, "r", encoding="UTF-8") as f:
        data = f.read()
    return json.loads(data)


def savef(data):
    data = json.dumps(data, ensure_ascii=False, indent=3)
    savemode = "w" if os.path.exists(FILEPATH) else "x"
    with open(FILEPATH, mode=savemode, encoding="UTF-8") as f:
        f.write(data)
        f.close()
    return True
